/* error dialog default title */
TIME_MACHINE_ERROR = "Time Machine nie może dokończyć archiwizacji.";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Otwórz preferencje Time Machine…";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "Ustawienia Time Machine na tym komputerze ustalane są przez zarządzane preferencje. Skontaktuj się z administratorem komputera.";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "Brak błędu.";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Nie udało się uruchomić Time Machine.";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "Nie udało się dokończyć archiwizowania. Wystąpił błąd podczas tworzenia katalogu archiwizacyjnego."; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "Dysk archiwizacyjny nie na formatu Mac OS Extended (Journaled), który jest wymagany.\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny.";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "Nie udało się sprawdzić stanu dysku archiwizacyjnego."; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "Na dysku archiwizacyjnym wyłączone są prawa dostępu. Trzeba włączyć prawa dostępu, aby móc użyć tego dysku do przechowywania archiwum Time Machine.\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny.";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "Dysk archiwizacyjny nie na formatu Mac OS Extended (Journaled), który jest wymagany.\n\n%@";
RESULTCODE_6_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny."; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "Ta kopia zapasowa jest zbyt duża dla tego dysku archiwizacyjnego. Potrzeba %@, a dostępne jest tylko %@.\n\n%@";
RESULTCODE_7_SHOWPREFS = "Poza miejscem dla archiwizowanych plików, Time Machine wymaga przestrzeni roboczej na dysku archiwizacyjnym. Otwórz preferencje Time Machine i wybierz większy dysk archiwizacyjny lub zmniejsz wielkość kopii zapasowej, wykluczając niektóre pliki."; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "Nie można skopiować plików na dysk archiwizacyjny, ponieważ jest on określony jako „tylko do odczytu”.\n\n%@";
RESULTCODE_8_SHOWPREFS = "Niezbędne może okazać się naprawienie dysku lub jego ponowne sformatowanie za pomocą Narzędzia dyskowego. Jeżeli naprawa dysku się nie powiedzie, trzeba będzie otworzyć preferencje Time Machine i wybrać inny dysk archiwizacyjny."; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "Na dysku archiwizacyjnym wyłączone są listy kontroli dostępu (ACL), a są one niezbędne.\n\n%@";
RESULTCODE_9_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny."; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "Wystąpił błąd podczas przygotowania archiwum."; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "Archiwizacja nie została wykonana, ponieważ wystąpił błąd podczas kopiowania plików na dysk archiwizacyjny.";
RESULTCODE_11_MESSAGE = "Może być to tymczasowy problem. Spróbuj wykonać archiwizację za jakiś czas. Jeżeli problem będzie się powtarzał, napraw dysk archiwizacyjny za pomocą Narzędzia dyskowego.";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "Wystąpił błąd podczas łączenia plików na dysku archiwizacyjnym."; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "Zbyt wiele plików uległo zmianie w czasie archiwizowania."; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "Wystąpił błąd podczas próby usunięcia nieaktualnych kopii zapasowych z dysku archiwizacyjnego.";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "Wszystkie nieaktualne kopie zapasowe zostały usunięte, ale na dysku archiwizacyjnym nadal brakuje miejsca.\n\n%@";
RESULTCODE_15_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz większy dysk archiwizacyjny.";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "Wszystkie nieaktualne kopie zapasowe zostały usunięte, ale na dysku archiwizacyjnym nadal brakuje miejsca.\n\n%@";
RESULTCODE_16_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz większy dysk archiwizacyjny."; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "Nie wybrano żadnego dysku archiwizacyjnego.\n\n%@";
RESULTCODE_17_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz dysk archiwizacyjny.";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "Nie udało się znaleźć dysku archiwizacyjnego.\n\n%@";
RESULTCODE_18_SHOWPREFS = "Upewnij się, że dysk archiwizacyjny jest podłączony lub otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny."; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "Dysk archiwizacyjny nie jest dostępny."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "Nie udało się utworzyć archiwizacyjnego obrazu dysku „%@” (błąd %@)."; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "Nie ma dostępu do archiwizacyjnego obrazu dysku „%@” (błąd %@)."; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "Tworzenie kopii zapasowej zostało anulowane."; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "Na archiwizowanym dysku rozróżniana jest wielkość liter w nazwach plików, nie jest ona jednak rozróżniana na dysku archiwizacyjnym.\n\n%@";
RESULTCODE_23_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny lub wybierz, aby nie archiwizować dysku z rozróżnieniem wielkości liter w nazwach plików."; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "Dwa z przeznaczonych do archiwizacji dysków mają takie same nazwy. Zmień nazwę któregoś z nich."; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "Nie ma żadnego dysku, który można zarchiwizować. Może się tak zdarzyć, gdy wszystkie dyski zostaną dodane do listy „Nie archiwizuj”.\n\n%@";
RESULTCODE_25_SHOWPREFS = "Jeżeli chcesz zmienić zawartość tej listy, otwórz preferencje Time Machine i kliknij w przycisk Opcje.";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "Time Machine nie mógł dokończyć archiwizacji z powodu problemów z siecią";
RESULTCODE_26_MESSAGE = "Upewnij się, że komputer oraz dysk archiwizacyjny są w tej samej sieci oraz czy archiwizacja jest włączona. Następnie spróbuj zarchiwizować ponownie.";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "Dysk archiwizacyjny mógł zostać wysunięty lub odłączony od tego komputera.";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "Nagle zabrakło miejsca na dysku archiwizacyjnym. Time Machine spróbuje zrobić miejsce, usuwając stare kopie zapasowe podczas następnego zaplanowanego archiwizowania.\n\n%@";
RESULTCODE_28_SHOWPREFS = "Otwórz preferencje Time Machine i wybierz większy dysk archiwizacyjny lub zmniejsz wielkość kopii zapasowej, wykluczając niektóre pliki."; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "Nie ma dostępu do dysku archiwizacyjnego, ponieważ pojawił się problem z nazwą użytkownika sieci lub hasłem.\n\n%@";
RESULTCODE_29_SHOWPREFS = "Otwórz preferencje Time Machine, aby wybrać sieciowy dysk archiwizacyjny i ponownie podać prawidłową nazwę użytkownika i hasło.";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "Wystąpił błąd podczas próby ponownego użycia archiwum „%@”.";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "Archiwizacyjny obraz dysku „%@” jest używany.";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "Nie udało się znaleźć archiwizacyjnego obrazu dysku „%@”.";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "Data i czas w komputerze ustawione są nieprawidłowo.";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "Ten komputer nie ma podstawowego interfejsu sieciowego.";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine nie może znaleźć niektórych swoich ustawień.\n\n%@";
RESULTCODE_35_SHOWPREFS = "Aby ponownie ustalić opcje Time Machine, otwórz preferencje Time Machine i wskaż dysk archiwizacyjny.";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "Time Machine nie może znaleźć swoich ustawień na dysku archiwizacyjnym „%@”.\n\nUpewnij się, że ten dysk jest podłączony i że żaden z pozostałych dysków nie ma takiej samej nazwy, jak dysk archiwizacyjny.\n\n%@";
RESULTCODE_36_SHOWPREFS = "Aby ponownie ustalić opcje Time Machine, otwórz preferencje Time Machine i wskaż dysk archiwizacyjny.";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "Jeden z archiwizowanych dysków mógł zostać wysunięty lub odłączony od tego komputera.";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "Time Machine nie może użyć obrazu dysku, ponieważ nie można w nim zapisywać.";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "Time Machine nie może zweryfikować kopii zapasowych, ponieważ dysk archiwizacyjny nie jest dostępny.";
RESULTCODE_40_MESSAGE = "Upewnij się, że komputer oraz dysk archiwizacyjny są w tej samej sieci oraz że dysk archiwizacyjny jest włączony. Następnie spróbuj ponownie, aby zweryfikować kopie zapasowe.";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine nie może zweryfikować kopii zapasowych.";
RESULTCODE_41_MESSAGE = "Dysk archiwizacyjny wydaje się być „tylko do odczytu”.";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "Time Machine nie może zweryfikować kopii zapasowych, ponieważ weryfikacja została przerwana.";
RESULTCODE_42_MESSAGE = "Zakłócenia są zwykle powodowane przez problemy z siecią. Spróbuj ponownie później, gdy zostaną one rozwiązane.";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "Time Machine nie może przenieść istniejącego archiwizacyjnego obrazu dysku „%@”";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "Time Machine nie może usunąć archiwizacyjnego obrazu dysku „%@”";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "Kod błędu: %@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "Dysk archiwizacyjny jest prawie pełny.";
RESULTCODE_1000_MESSAGE = "Gdy dysk archiwizacyjny będzie pełny, Time Machine usunie stare kopie zapasowe, aby zwolnić miejsce dla nowych.\n\n%@";
RESULTCODE_1000_SHOWPREFS = "Jeżeli chcesz zachować starsze kopie zapasowe, otwórz preferencje Time Machine i wybierz nowy dysk archiwizacyjny.";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "Dysk archiwizacyjny jest pełny.";
RESULTCODE_1001_MESSAGE = "Time Machine usunął co najmniej jedną kopię zapasową, aby zwolnić miejsce na nowe kopie zapasowe. Najstarsza zachowana kopia zapasowa to: %@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "Jeżeli chcesz uniknąć usunięcia starych kopii zapasowych, otwórz preferencje Time Machine i wybierz inny dysk archiwizacyjny."; 
RESULTCODE_1001_CHECKBOX = "Nie pokazuj ponownie tego ostrzeżenia.";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "Time Machine nie archiwizował tego komputera przez %@ dni.\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "Upewnij się, że dysk archiwizacyjny jest dostępny, lub otwórz preferencje Time Machine i wybierz nowy dysk archiwizacyjny.";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "Czy chcesz, aby ten komputer używał archiwum „%@”?";
RESULTCODE_1003_MESSAGE = "To archiwum zostało utworzone na innym komputerze. Jeżeli użyjesz teraz tego archiwum, nie będzie dało się go ponownie użyć na oryginalnym komputerze.";
REUSE_BACKUP_BUTTON = "Użyj archiwum ponownie";
CREATE_NEW_BACKUP_BUTTON = "Utwórz nowe archiwum";
ASK_LATER_BUTTON = "Nie archiwizuj teraz";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "Dostępne jest uaktualnienie dla „%@”…";
RESULTCODE_1004_MESSAGE = "To uaktualnienie zwiększa niezawodność Time Capsule. Aby je zainstalować, otwórz Narzędzie AirPort. Konieczne może być podanie hasła Time Capsule dla „%@”.";
REMIND_LATER_BUTTON = "Uaktualnij później";
AIRPORT_UTILITY_BUTTON = "Otwórz Narzędzie Airport…";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine zakończył weryfikację kopii zapasowych. Aby ograniczyć ryzyko błędów archiwizacji, Time Machine musi utworzyć nowe archiwum.";
RESULTCODE_1006_MESSAGE = "Aby rozpocząć tworzenie nowego archiwum, kliknij w Utwórz nowe archiwum. Spowoduje to usunięcie istniejącej historii archiwizacji i może potrwać kilka godzin.\n\nJeśli klikniesz w Archiwizuj później, system wyświetli odpowiednie przypomnienie jutro. W tym czasie nowe kopie zapasowe Time Machine nie będą tworzone.";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "Utwórz nowe archiwum";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "Archiwizuj później";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "Tożsamość dysku archiwizacyjnego uległa zmianie od ostatniej archiwizacji.";
RESULTCODE_1008_MESSAGE = "Dysk mógł zostać wymieniony lub wymazany, albo ktoś inny próbuje zmusić Twój komputer do wykonania kopii zapasowej na niewłaściwym dysku.";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "Użyj tego dysku";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "Nie archiwizuj";

// UNITS
KB = " KB";
MB = " MB";
GB = " GB";
TB = " TB";
